In [2]:
import pandas as pd
import numpy as np

vg=pd.read_csv('../lesson4/vgsales.csv')
vg.head(3)

,Rank,Name,Platform,Year,Genre,Publisher,NA_Sales,EU_Sales,JP_Sales,Other_Sales,Global_Sales
0,1,Wii Sports,Wii,2006.0,Sports,Nintendo,41.49,29.02,3.77,8.46,82.74
1,2,Super Mario Bros.,NES,1985.0,Platform,Nintendo,29.08,3.58,6.81,0.77,40.24
2,3,Mario Kart Wii,Wii,2008.0,Racing,Nintendo,15.85,12.88,3.79,3.31,35.82

In [5]:
vg['new_col']=np.zeros(vg.shape[0])
vg.head(3)

,Rank,Name,Platform,Year,Genre,Publisher,NA_Sales,EU_Sales,JP_Sales,Other_Sales,Global_Sales,new_col
0,1,Wii Sports,Wii,2006.0,Sports,Nintendo,41.49,29.02,3.77,8.46,82.74,0.0
1,2,Super Mario Bros.,NES,1985.0,Platform,Nintendo,29.08,3.58,6.81,0.77,40.24,0.0
2,3,Mario Kart Wii,Wii,2008.0,Racing,Nintendo,15.85,12.88,3.79,3.31,35.82,0.0

In [9]:
vg.drop('Platform',axis=1)

,Rank,Name,Year,Genre,Publisher,NA_Sales,EU_Sales,JP_Sales,Other_Sales,Global_Sales,new_col
0,1,Wii Sports,2006.0,Sports,Nintendo,41.49,29.02,3.77,8.46,82.74,0.0
1,2,Super Mario Bros.,1985.0,Platform,Nintendo,29.08,3.58,6.81,0.77,40.24,0.0
2,3,Mario Kart Wii,2008.0,Racing,Nintendo,15.85,12.88,3.79,3.31,35.82,0.0
3,4,Wii Sports Resort,2009.0,Sports,Nintendo,15.75,11.01,3.28,2.96,33.00,0.0
4,5,Pokemon Red/Pokemon Blue,1996.0,Role-Playing,Nintendo,11.27,8.89,10.22,1.00,31.37,0.0
...,...,...,...,...,...,...,...,...,...,...,...
16593,16596,Woody Woodpecker in Crazy Castle 5,2002.0,Platform,Kemco,0.01,0.00,0.00,0.00,0.01,0.0
16594,16597,Men in Black II: Alien Escape,2003.0,Shooter,Infogrames,0.01,0.00,0.00,0.00,0.01,0.0
16595,16598,SCORE International Baja 1000: The Official Game,2008.0,Racing,Activision,0.00,0.00,0.00,0.00,0.01,0.0
16596,16599,Know How 2,2010.0,Puzzle,7G//AMES,0.00,0.01,0.00,0.00,0.01,0.0
16597,16600,Spirits & Spells,2003.0,Platform,Wanadoo,0.01,0.00,0.00,0.00,0.01,0.0

In [11]:
vg.drop(vg.columns[vg.shape[1]-1],axis=1)

,Rank,Name,Platform,Year,Genre,Publisher,NA_Sales,EU_Sales,JP_Sales,Other_Sales,Global_Sales
0,1,Wii Sports,Wii,2006.0,Sports,Nintendo,41.49,29.02,3.77,8.46,82.74
1,2,Super Mario Bros.,NES,1985.0,Platform,Nintendo,29.08,3.58,6.81,0.77,40.24
2,3,Mario Kart Wii,Wii,2008.0,Racing,Nintendo,15.85,12.88,3.79,3.31,35.82
3,4,Wii Sports Resort,Wii,2009.0,Sports,Nintendo,15.75,11.01,3.28,2.96,33.00
4,5,Pokemon Red/Pokemon Blue,GB,1996.0,Role-Playing,Nintendo,11.27,8.89,10.22,1.00,31.37
...,...,...,...,...,...,...,...,...,...,...,...
16593,16596,Woody Woodpecker in Crazy Castle 5,GBA,2002.0,Platform,Kemco,0.01,0.00,0.00,0.00,0.01
16594,16597,Men in Black II: Alien Escape,GC,2003.0,Shooter,Infogrames,0.01,0.00,0.00,0.00,0.01
16595,16598,SCORE International Baja 1000: The Official Game,PS2,2008.0,Racing,Activision,0.00,0.00,0.00,0.00,0.01
16596,16599,Know How 2,DS,2010.0,Puzzle,7G//AMES,0.00,0.01,0.00,0.00,0.01
16597,16600,Spirits & Spells,GBA,2003.0,Platform,Wanadoo,0.01,0.00,0.00,0.00,0.01

In [73]:

v# vg.columns
g# =vg.set_index(['NaName,inplace=False)
vg.# drop([0,31985.0,2008.0h,inplace=False,axis=0ead(5)

KeyError: "None of ['Name'] are in the columns"

### map, apply, transform

In [70]:
def fun(ele):
    return ele*10000000.
vg['Global_Sales'].map(fun).head(5)

Year
1985.0    402400000.0
2008.0    358200000.0
2009.0    330000000.0
1996.0    313700000.0
1989.0    302600000.0
2009.0    286200000.0
1984.0    283100000.0
2005.0    247600000.0
2005.0    234200000.0
1999.0    231000000.0
Name: Global_Sales, dtype: float64

In [80]:
vg=pd.read_csv('../lesson4/vgsales.csv')
# vg.columns
# Eu_Sales also could be list
vg[vg['Year']==2010].sort_values('EU_Sales',ascending=False).head(10)

,Rank,Name,Platform,Year,Genre,Publisher,NA_Sales,EU_Sales,JP_Sales,Other_Sales,Global_Sales
15,16,Kinect Adventures!,X360,2010.0,Misc,Microsoft Game Studios,14.97,4.94,0.24,1.67,21.82
54,55,Gran Turismo 5,PS3,2010.0,Racing,Sony Computer Entertainment,2.96,4.88,0.81,2.12,10.77
40,41,Call of Duty: Black Ops,PS3,2010.0,Shooter,Activision,5.98,4.44,0.48,1.83,12.73
31,32,Call of Duty: Black Ops,X360,2010.0,Shooter,Activision,9.67,3.73,0.11,1.13,14.64
78,79,Wii Party,Wii,2010.0,Misc,Nintendo,1.79,3.53,2.49,0.68,8.49
199,200,FIFA Soccer 11,PS3,2010.0,Sports,Electronic Arts,0.60,3.29,0.06,1.13,5.08
26,27,Pokemon Black/Pokemon White,DS,2010.0,Role-Playing,Nintendo,5.57,3.28,5.65,0.82,15.32
68,69,Just Dance 2,Wii,2010.0,Misc,Ubisoft,5.84,2.89,0.01,0.78,9.52
117,118,Zumba Fitness,Wii,2010.0,Sports,505 Games,3.50,2.64,0.00,0.67,6.81
123,124,Red Dead Redemption,PS3,2010.0,Action,Take-Two Interactive,2.79,2.61,0.17,1.03,6.60

In [82]:
# 数值型
vg.describe()

,Rank,Year,NA_Sales,EU_Sales,JP_Sales,Other_Sales,Global_Sales
count,16598.000000,16327.000000,16598.000000,16598.000000,16598.000000,16598.000000,16598.000000
mean,8300.605254,2006.406443,0.264667,0.146652,0.077782,0.048063,0.537441
std,4791.853933,5.828981,0.816683,0.505351,0.309291,0.188588,1.555028
min,1.000000,1980.000000,0.000000,0.000000,0.000000,0.000000,0.010000
25%,4151.250000,2003.000000,0.000000,0.000000,0.000000,0.000000,0.060000
50%,8300.500000,2007.000000,0.080000,0.020000,0.000000,0.010000,0.170000
75%,12449.750000,2010.000000,0.240000,0.110000,0.040000,0.040000,0.470000
max,16600.000000,2020.000000,41.490000,29.020000,10.220000,10.570000,82.740000

In [83]:
vg.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 16598 entries, 0 to 16597
Data columns (total 11 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   Rank          16598 non-null  int64
 1   Name          16598 non-null  object
 2   Platform      16598 non-null  object
 3   Year          16327 non-null  float64
 4   Genre         16598 non-null  object
 5   Publisher     16540 non-null  object
 6   NA_Sales      16598 non-null  float64
 7   EU_Sales      16598 non-null  float64
 8   JP_Sales      16598 non-null  float64
 9   Other_Sales   16598 non-null  float64
 10  Global_Sales  16598 non-null  float64
dtypes: float64(6), int64(1), object(4)
memory usage: 1.4+ MB

In [89]:
vg.groupby('Name').sum().sort_values('Global_Sales',ascending=False)

,Rank,Year,NA_Sales,EU_Sales,JP_Sales,Other_Sales,Global_Sales
Name,,,,,,,
Wii Sports,1,2006.0,41.49,29.02,3.77,8.46,82.74
Grand Theft Auto V,2182,10069.0,23.46,23.04,1.39,8.03,55.92
Super Mario Bros.,203,3984.0,32.48,4.88,6.96,0.99,45.31
Tetris,162,3977.0,26.17,2.95,6.03,0.69,35.84
Mario Kart Wii,3,2008.0,15.85,12.88,3.79,3.31,35.82
...,...,...,...,...,...,...,...
WinBack 2: Project Poseidon,16037,2006.0,0.01,0.01,0.00,0.00,0.01
Super Robot Taisen XO,16066,2006.0,0.00,0.00,0.01,0.00,0.01
Dragon Quest X: All in One Package,16329,2015.0,0.00,0.00,0.01,0.00,0.01
Deus Ex,16166,2000.0,0.00,0.01,0.00,0.00,0.01
Junjou Romanchika: Koi no Doki Doki Daisakusen,16449,2008.0,0.00,0.00,0.01,0.00,0.01

In [96]:
vg['Name'].value_counts()['Grand Theft Auto V']

5

In [95]:
vg[vg.Name=='FIFA 14']

,Rank,Name,Platform,Year,Genre,Publisher,NA_Sales,EU_Sales,JP_Sales,Other_Sales,Global_Sales
112,113,FIFA 14,PS3,2013.0,Sports,Electronic Arts,0.78,4.32,0.07,1.73,6.90
256,257,FIFA 14,X360,2013.0,Sports,Electronic Arts,0.92,2.93,0.01,0.46,4.31
493,494,FIFA 14,PS4,2013.0,Sports,Electronic Arts,0.61,1.85,0.11,0.33,2.90
1698,1700,FIFA 14,XOne,2013.0,Sports,Electronic Arts,0.41,0.66,0.00,0.12,1.19
3988,3990,FIFA 14,PSV,2013.0,Sports,Electronic Arts,0.11,0.25,0.01,0.13,0.50
4503,4505,FIFA 14,PC,2013.0,Sports,Electronic Arts,0.01,0.36,0.00,0.06,0.43
4538,4540,FIFA 14,Wii,2013.0,Sports,Electronic Arts,0.00,0.38,0.00,0.05,0.43
6661,6663,FIFA 14,3DS,2013.0,Sports,Electronic Arts,0.00,0.23,0.00,0.03,0.25
7034,7036,FIFA 14,PSP,2013.0,Sports,Electronic Arts,0.00,0.16,0.00,0.07,0.23

In [98]:
# 按照列
vg.agg(['max','min'])

,Rank,Name,Platform,Year,Genre,NA_Sales,EU_Sales,JP_Sales,Other_Sales,Global_Sales
max,16600,¡Shin Chan Flipa en colores!,XOne,2020.0,Strategy,41.49,29.02,10.22,10.57,82.74
min,1,'98 Koshien,2600,1980.0,Action,0.00,0.00,0.00,0.00,0.01

In [100]:
vg.agg('mean',axis='columns')

Series([], dtype: float64)

In [105]:
vg_grouped=vg[['Name','Year','Global_Sales']].groupby('Name').agg({'Year':'count','Global_Sales':'sum'})

vg_grouped.columns=['Year','Global_Sales']
vg_grouped.sort_values('Year',ascending=False)

                                         Year  Global_Sales
Name
Need for Speed: Most Wanted                12         14.08
FIFA 14                                     9         17.14
Ratatouille                                 9          4.46
LEGO Marvel Super Heroes                    9          9.86
Monopoly                                    8          7.70
...                                       ...           ...
The Daring Game for Girls                   0          0.22
Saint                                       0          0.02
TERA                                        0          0.41
Housekeeping                                0          0.04
Shonen Jump's Yu-Gi-Oh! GX Card Almanac     0          0.02

[11493 rows x 2 columns]